# VertexPair Class

---
Indices of a pair of vertices in two CurveLoops(one vertex in each loop).
SystemObject Autodesk.Revit.DBVertexPair
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class VertexPair : IDisposable

    Public Class VertexPair
    	Implements IDisposable

    public ref class VertexPair : IDisposable

    type VertexPair =
        class
            interface IDisposable
        end
The VertexPair type exposes the following members.
| Name| Description
---|---|---
| VertexPair|  Constructs a new VertexPair from a pair of indices in the curve loops.
Top
| Name| Description
---|---|---
| First|  Identifies the first index of VertexPair.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Second|  Identifies the second index of VertexPair.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the VertexPair
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.
#### Reference
Autodesk.Revit.DB Namespace